{
  "architectures": [
    "Qwen2ParScaleForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_qwen2_parscale.Qwen2ParScaleConfig",
    "AutoModelForCausalLM": "modeling_qwen2_parscale.Qwen2ParScaleForCausalLM"
  },
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "initializer_range": 0.02,
  "intermediate_size": 8320,
  "max_position_embeddings": 2048,
  "max_window_layers": 36,
  "model_type": "qwen2_parscale",
  "num_attention_heads": 16,
  "num_hidden_layers": 36,
  "num_key_value_heads": 2,
  "parscale_attn_smooth": 0.1,
  "parscale_n": 8,
  "parscale_n_tokens": 48,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "torch_dtype": "float16",
  "transformers_version": "4.53.3",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
